Duet3D/Duet3Expansion/src/atmel/SAMS70_DFP/2.3.88/sams70b/edc/ATSAMS70Q20B.PIC
      <edc:SFRDef edc:_addr="0x4008C008" edc:access="----------rr----------rr-rrr-rrr" edc:cname="I2SC0_SR" edc:nzwidth="0x20" ltx:memberofperipheral="I2SC0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RXEN" edc:desc="Receiver Enabled" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXRDY" edc:desc="Receive Ready" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXOR" edc:desc="Receive Overrun" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="TXEN" edc:desc="Transmitter Enabled" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXRDY" edc:desc="Transmit Ready" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXUR" edc:desc="Transmit Underrun" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="RXORCH" edc:desc="Receive Overrun Channel" edc:nzwidth="0x2"/>
            <edc:AdjustPoint edc:offset="0xA"/>
            <edc:SFRFieldDef edc:cname="TXURCH" edc:desc="Transmit Underrun Channel" edc:nzwidth="0x2"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4008C00C" edc:access="----------ww----------ww-w---w--" edc:cname="I2SC0_SCR" edc:nzwidth="0x20" ltx:memberofperipheral="I2SC0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="RXOR" edc:desc="Receive Overrun Status Clear" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="TXUR" edc:desc="Transmit Underrun Status Clear" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="RXORCH" edc:desc="Receive Overrun Per Channel Status Clear" edc:nzwidth="0x2"/>
            <edc:AdjustPoint edc:offset="0xA"/>
            <edc:SFRFieldDef edc:cname="TXURCH" edc:desc="Transmit Underrun Per Channel Status Clear" edc:nzwidth="0x2"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4008C010" edc:access="----------ww----------ww-w---w--" edc:cname="I2SC0_SSR" edc:nzwidth="0x20" ltx:memberofperipheral="I2SC0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="RXOR" edc:desc="Receive Overrun Status Set" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="TXUR" edc:desc="Transmit Underrun Status Set" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="RXORCH" edc:desc="Receive Overrun Per Channel Status Set" edc:nzwidth="0x2"/>
            <edc:AdjustPoint edc:offset="0xA"/>
            <edc:SFRFieldDef edc:cname="TXURCH" edc:desc="Transmit Underrun Per Channel Status Set" edc:nzwidth="0x2"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4008C014" edc:access="-------------------------ww--ww-" edc:cname="I2SC0_IER" edc:nzwidth="0x20" ltx:memberofperipheral="I2SC0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="RXRDY" edc:desc="Receiver Ready Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXOR" edc:desc="Receiver Overrun Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="TXRDY" edc:desc="Transmit Ready Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXUR" edc:desc="Transmit Underflow Interrupt Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4008C018" edc:access="-------------------------ww--ww-" edc:cname="I2SC0_IDR" edc:nzwidth="0x20" ltx:memberofperipheral="I2SC0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="RXRDY" edc:desc="Receiver Ready Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXOR" edc:desc="Receiver Overrun Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="TXRDY" edc:desc="Transmit Ready Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXUR" edc:desc="Transmit Underflow Interrupt Disable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4008C01C" edc:access="-------------------------rr--rr-" edc:cname="I2SC0_IMR" edc:nzwidth="0x20" ltx:memberofperipheral="I2SC0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="RXRDY" edc:desc="Receiver Ready Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXOR" edc:desc="Receiver Overrun Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="TXRDY" edc:desc="Transmit Ready Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXUR" edc:desc="Transmit Underflow Interrupt Disable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4008C020" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="I2SC0_RHR" edc:nzwidth="0x20" ltx:memberofperipheral="I2SC0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RHR" edc:desc="Receiver Holding Register" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
