Duet3D/Duet3Expansion/src/atmel/SAMS70_DFP/2.3.88/sams70b/edc/ATSAMS70Q20B.PIC
    <edc:Pin>
      <edc:VirtualPin edc:name="PA23" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="SCK1" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="PWMH0" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="A19" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="A19" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="A19" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="PWML2" edc:ppsfunction="D"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA15" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="D14" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="D14" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="D14" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="TIOA1" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="PWML3" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="WS" edc:ppsfunction="D"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PD26" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="PWML2" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="TD" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="UTXD2" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="UTXD1" edc:ppsfunction="D"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA24" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="RTS1" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="PWMH1" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="A20" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="A20" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="A20" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="PCK" edc:ppsfunction="D"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PC5" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="D5" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="D5" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="D5" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="TIOA6" edc:ppsfunction="B"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA10" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="UTXD0" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="PWMEXTRG0" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="RD" edc:ppsfunction="C"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA12" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="QIO1" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="PWMH1" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="PWMH0" edc:ppsfunction="C"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PD17" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="SCK2" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="CAS" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="CAS" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="CAS" edc:ppsfunction="C"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PC28" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="A10" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="A10" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="A10" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="TCLK4" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="NPCS1" edc:ppsfunction="C"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PD30" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="UTXD3" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="D10" edc:ppsfunction="D"/>
      <edc:VirtualPin edc:name="AD0" edc:ppsfunction="X1"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA8" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="PWMH3" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="ADTRG" edc:ppsfunction="B"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA13" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="QIO0" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="PWMH2" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="PWML1" edc:ppsfunction="C"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PC7" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="D7" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="D7" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="D7" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="TCLK6" edc:ppsfunction="B"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PD25" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="PWML1" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="NPCS1" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="URXD2" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="VSYNC" edc:ppsfunction="D"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PD24" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="PWML0" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="RF" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="TCLK11" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="HSYNC" edc:ppsfunction="D"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PD23" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="PWMH3" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="SDCK" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="SDCK" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="SDCK" edc:ppsfunction="C"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PD22" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="PWMH2" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="SPCK" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="TIOB11" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="D0" edc:ppsfunction="D"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PD19" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="NCS3" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="NCS3" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="NCS3" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="CTS2" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="UTXD4" edc:ppsfunction="C"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PD18" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="NCS1" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="SDCS" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="NCS1" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="SDCS" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="NCS1" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="SDCS" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="RTS2" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="URXD4" edc:ppsfunction="C"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA5" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="PWML3" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="D4" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="URXD1" edc:ppsfunction="C"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA9" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="URXD0" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="D3" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="PWMFI0" edc:ppsfunction="C"/>
    </edc:Pin>
  </edc:PinList>
</edc:PIC>